Revit 2026 API

# ExportPatternTable Class

---

A table supporting a mapping of FillPatterns in Revit to pattern names that will be set in the target export format.

SystemObject Autodesk.Revit.DBExportPatternTable

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class ExportPatternTable : IEnumerable<KeyValuePair<ExportPatternKey, ExportPatternInfo>>,
	IDisposable
```
```vb
Public Class ExportPatternTable
	Implements IEnumerable(Of KeyValuePair(Of ExportPatternKey, ExportPatternInfo)),
	IDisposable
```
```cpp
public ref class ExportPatternTable : IEnumerable<KeyValuePair<ExportPatternKey^, ExportPatternInfo^>>,
	IDisposable
```
```fsharp
type ExportPatternTable =
    class
        interface IEnumerable<KeyValuePair<ExportPatternKey, ExportPatternInfo>>
        interface IDisposable
    end
```

The ExportPatternTable type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | ExportPatternTable | Constructs a new ExportPatternTable with default values. |

|  | Name | Description |
| --- | --- | --- |
|  | Count | Count of the items contained in the collection. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | Item | A copy of the ExportPatternInfo for the pattern's ExportPatternKey. |

|  | Name | Description |
| --- | --- | --- |
|  | Add | Inserts a (key,info) pair into Export pattern table. |
|  | Clear | Removes all contents stored in the table. |
|  | ContainsKey | Checks whether a pattern key exists in the table. |
|  | Dispose | Releases all resources used by the ExportPatternTable |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetBasicIEnumerator | Returns an enumerator that iterates through a collection. |
|  | GetEnumerator | Returns an enumerator that iterates through a collection. |
|  | GetExportPatternInfo | Gets a copy of the pattern info associated to the input pattern key. |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetKeys | Gets all the keys stored in the map. |
|  | GetPatternTableIterator | Returns a PatternTableIterator that iterates through the collection. |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | GetValues | Returns all the values stored in the map. |
|  | Remove | Removes the pair (key, info) by pattern key. |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

This table is structured as a mapping from ExportPatternKey to ExportPatternInfo members. The ExportPatternKey contains the identification information for the pattern table: the Revit fill pattern type and name. The ExportPatternInfo contains the pattern name to use in the export format.

The table can be accessed via direct iteration as a collection of KeyValuePairs, or by traversal of the stored keys obtained from GetKeys(), or via specific lookup of a key constructed externally. In all cases, the ExportPatternInfo returned will be a copy of the ExportPatternInfo from the table. In order to make changes to the ExportPatternInfo and use those settings during export, set the modified ExportPatternInfo back into the table using the same key.

#### Reference

Autodesk.Revit.DB Namespace